import React from 'react';
import { Header, Footer } from '../../components';
import DirectionCard from '../../components/directionCard';
import styles from './directionsListPage.module.scss';

const DirectionsListPage = () => {
  const directionsList = [
    {
      id: '05',
      name: 'Соціальні та поведінкові науки',
      description:
        'Символіка риби містить багато різноманітних, іноді полярно протилежних значень. З часів глибокої давнини риба асоціювалась із Вчителями, світовими Спасителями, праотцями, мудрістю. До символу риби мають відношення індуїстський Вішну, єгипетський Гор, халдейський Оаннес, а також Христос. Учні, послідовники, які живуть у «воді вчення», часто уподібнюються рибам.',
      specialties: [
        { id: '051', name: 'Економіка (Економічна кібернетика)' },
        { id: '051', name: 'Економіка (Інформаційні технології в бізнесі)' },
      ],
    },

    {
      id: '11',
      name: 'Математика та статистика',
      description:
        'Символіка риби містить багато різноманітних, іноді полярно протилежних значень. З часів глибокої давнини риба асоціювалась із Вчителями, світовими Спасителями, праотцями, мудрістю. До символу риби мають відношення індуїстський Вішну, єгипетський Гор, халдейський Оаннес, а також Христос. Учні, послідовники, які живуть у «воді вчення», часто уподібнюються рибам.',
      specialties: [{ id: '113', name: 'Прикладна математика' }],
    },

    {
      id: '12',
      name: 'Інформаційні технології',
      description:
        'Символіка риби містить багато різноманітних, іноді полярно протилежних значень. З часів глибокої давнини риба асоціювалась із Вчителями, світовими Спасителями, праотцями, мудрістю. До символу риби мають відношення індуїстський Вішну, єгипетський Гор, халдейський Оаннес, а також Христос. Учні, послідовники, які живуть у «воді вчення», часто уподібнюються рибам.',
      specialties: [
        {
          id: '121',
          name: 'Інженерія програмного забезпечення (Інтернет речей)',
        },
        { id: '122', name: 'Комп’ютерні науки' },
        { id: '122', name: 'Комп’ютерні науки (Прикладна інформатика)' },
        { id: '123', name: 'Комп’ютерна інженерія' },
        { id: '126', name: 'Інформаційні системи та технології' },
      ],
    },

    {
      id: '14',
      name: 'Електрична інженерія',
      description:
        'Символіка риби містить багато різноманітних, іноді полярно протилежних значень. З часів глибокої давнини риба асоціювалась із Вчителями, світовими Спасителями, праотцями, мудрістю. До символу риби мають відношення індуїстський Вішну, єгипетський Гор, халдейський Оаннес, а також Христос. Учні, послідовники, які живуть у «воді вчення», часто уподібнюються рибам.',
      specialties: [
        {
          id: '141',
          name: 'Електроенергетика, електротехніка та електромеханіка',
        },
        {
          id: '141',
          name:
            'Електроенергетика, електротехніка та електромеханіка (Smart-енергетика та електромобільність)',
        },
        {
          id: '141',
          name:
            'Електроенергетика, електротехніка та електромеханіка (Енергетичний менеджмент та енергоефективні технології)',
        },
      ],
    },

    {
      id: '15',
      name: 'Автоматизація та приладобудування',
      description:
        'Символіка риби містить багато різноманітних, іноді полярно протилежних значень. З часів глибокої давнини риба асоціювалась із Вчителями, світовими Спасителями, праотцями, мудрістю. До символу риби мають відношення індуїстський Вішну, єгипетський Гор, халдейський Оаннес, а також Христос. Учні, послідовники, які живуть у «воді вчення», часто уподібнюються рибам.',
      specialties: [
        {
          id: '151',
          name: 'Автоматизація та комп’ютерно-інтегровані технології',
        },
        {
          id: '151',
          name:
            'Автоматизація та комп’ютерно-інтегровані технології (Робототехніка та штучний інтелект)',
        },
      ],
    },
  ];

  const directionsCardList = directionsList.map((item: any) => {
    return (
      <DirectionCard
        key={item.id}
        id={item.id}
        name={item.name}
        description={item.description}
        specialties={item.specialties}
      />
    );
  });

  return (
    <>
      <Header />
      <section className={styles.directionsPage}>
        <h1 data-testid='heading' className={styles.title}>
          Освітні напрямки
        </h1>
        {directionsCardList}
      </section>
      <Footer />
    </>
  );
};

export default DirectionsListPage;
