import * as Yup from 'yup';

const editIOEValidationSchema = Yup.object().shape({
  name: Yup.string()
    .min(2, 'Замала кількість введених символів')
    .max(85, 'Кількість введених символів перевищує допустиме значення')
    .required('Заповніть поле'),

  institutionOfEducationType: Yup.string()
    .min(1, 'Оберіть тип закладу')
    .required('Оберіть тип закладу'),

  abbreviation: Yup.string()
    .min(2, 'Замала кількість введених символів')
    .max(10, 'Кількість введених символів перевищує допустиме значення')
    .required('Заповніть поле'),

  address: Yup.string()
    .min(2, 'Замала кількість введених символів')
    .max(85, 'Кількість введених символів перевищує допустиме значення')
    .required('Заповніть поле'),

  site: Yup.string()
    .matches(
      /^(http:\/\/|https:\/\/)/i,
      'Aдреса повинна починатись з http:// або https://'
    )
    .matches(
      /^(http:\/\/|https:\/\/)([a-z0-9][a-z0-9-]*\.)+[a-z0-9][a-z0-9-]*$/i,
      'Адресу сайту введено не вірно'
    )
    .min(2, 'Замала кількість введених символів')
    .max(50, 'Кількість введених символів перевищує допустиме значення')
    .required('Заповніть поле'),

  phone: Yup.string()
    .matches(
      /^(\+?\d{0,4})?\s?-?\s?(\(?\d{3}\)?)\s?-?\s?(\(?\d{3}\)?)\s?-?\s?(\(?\d{4}\)?)?$/,
      'Номер телефону введено невірно, введіть будь ласка в такому форматі +380670000000'
    )
    .min(12, 'Номер телефону має містити не менше ніж 12 символів')
    .max(13, 'Кількість введених символів перевищує допустиме значення')
    .required('Вкажіть номер телефону'),

  email: Yup.string()
    .email('Введіть дійсну електронну адресу')
    .required('Заповніть поле')
    .max(
      70,
      'Занадто велика кількість символів,перевірте правильність ведення електронної пошти'
    ),

  description: Yup.string()
    .required('Заповніть поле')
    .min(50, 'Кількість символів повинна бути більше 50'),
});

export default editIOEValidationSchema;
